Repository: seanpm2001/mt-training-data
Catalog: ve/ve_pontoon.tmx
Source language: en_us
Languages: ve

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
ve: Ri khou lingedza u wana maipfi kha tshitshavha uri ri ite dataset ine ya ḓo shumiswa nga nnyi na nnyi. Nikelani nga ipfi ḽaṋu, khwaṱhisedzani uri zwe vhaṅwe vha rekhoda ndi zwone, itelani vhathu vhoṱhe dataset ya khwine khwine.

source: We’re experiencing unexpected downtime
ve: Ri khou ṱangana na thaidzo ya u sa shuma ha site zwazwino

source: We’re going out to get coffee.
ve: Ri khou ya u nwa gofhi

source: We release the dataset every 3 months.
ve: Ri riḽiza dataset nga murahu ha miṅwedzi 3 tshifhinga tshoṱhe.

source: We're receiving a lot of traffic and are currently investigating the issues.
ve: Hu na trafiki ine ya khou itea kha saiti, ri khou ita ṱhoduluso ya heyi thaidzo.

source: We’re sorry, your platform is not currently supported.
ve: Ri humbela pfarelo, puḽatifomo yaṋu a yi tikedziwi zwa zwino.

source: We use a Mozilla tool called <pontoonLink>Pontoon</pontoonLink> for translations. Pontoon has lots of languages, but if it doesn’t have yours you can <pontoonRequestLink>request for your language to be added</pontoonRequestLink>. Then, to make the language available on the Common Voice project, <githubRepoLink>request the new language on GitHub</githubRepoLink>. <localizationFragment>See more on site translation</localizationFragment>.
ve: Ri shumisa tshishumiswa tsha Mozilla tshine tsha pfi <pontoonLink>Pontoon</pontoonLink> u ṱalutshedzela. Pontoon i na nyambo nnzhi, arali luambo lwaṋu lu siho ni nga ita <pontoonRequestLink> khumbelo ya uri luambo lwaṋu lu dzheniswe</pontoonRequestLink>. Nga zwenezwo, u itela uri luambo lwaṋu lu kone u vha tshipiḓa tsha thandela tsha Common Voice, <githubRepoLink>itani khumbelo ya luambo luswa kha GitHub</githubRepoLink>. <localizationFragment>Vhonani zwo engedzeaho kha siaṱari ḽa u ṱalutshedzela</localizationFragment>.

source: We've run out of clips to validate in this language...
ve: Ro fhelelwa nga zwo rekhodiwaho zwine zwa ṱoḓa u khwaṱhisedzwa...

source: We've run out of sentences to record in this language...
ve: Ro fhelelwa nga mitaladzi ya u rekhoda nga holwu luambo...

source: We want speech models to be better at understanding a diverse range of speakers. For this to happen, a voice dataset must represent lots of different people.
ve: Ri ṱoḓa uri zwishumiswa zwa u ḓivha ipfi zwi kone u pfesesa vhaambi vho fhambananaho khwine. Uri zwenezwi zwi konadzee, dataset i tea u vha i na vhathu vhanzhi vho fhambananaho.

source: We want the Common Voice dataset to reflect the audio quality a speech-to-text engine will hear in the wild, so we’re looking for variety. In addition to a diverse community of speakers, a dataset with varying audio quality will teach the speech-to-text engine to handle various real-world situations, from background talking to car noise. As long as your voice clip is intelligible, it should be good enough for the dataset.
ve: Ri khou ṱoḓa uri Common Voice dataset i vhe na odio ine tshishumiswa tsha u pfa maipfi tsha a ṅwala; tsha ḓo a pfa mashangoni a kule, ndi ngazwo ri tshi khou ṱoḓa maipfi o fhambananaho. Zwiṅwe zwine ra zwi ṱoḓa nga nnḓa ha vhaambi vho fhambananaho, dataset ine ya vha na odio dzo fhambananaho i ḓo thusa tshishumiswa tsha u pfa maipfi tsha a ṅwala uri tshi imedzane na nyimelo dzo fhambananaho dza vhukuma, dzi ngaho u amba hu na goloi ine ya khou ita phosho. Tsha ndeme ndi tsha uri ipfi ḽanu ḽo rekhodiwaho ḽivhe ḽo tsha, ḽi tea u vha ḽi ḽavhuḓi uri ḽi dzhene kha dataset.

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
ve: Ri ḓo ṱoḓa uri algorithm dza machine learning dzi kone u fhambanyisa phosho i re nga murahu, na phosho ya khulwane i nga tendela, fhedzi a yo ngo tea u thivhela uri ni pfe zwoṱhe zwo ambiwaho. Muzika u re fhasi wo tendelwa; muzika u ne wa khou ita phosho lune ni si kone u pfa maipfi oṱhe ane muṅwe a khou a amba a wo ngo tendelwa.

source: We will also <strong>let our community manager know that you’re interested</strong>, so they can give you any extra support or information you might need.
ve: Ri ḓo <strong>vhudza minidzhere wa vhadzulapo vha vhuponi haṋu uri ni na dzangalelo ḽa hezwi</strong>, u itela uri vha ni tikedze kana u ni vhudza mafhungo ane na nga a ṱoḓa.

source: We will be in touch with more information about how to add your language to Common Voice very soon.
ve: Ri ḓo ni kwama hu si kale uri ri ni vhudze zwinzhi nga ha uri lumbo lwaṋu ni nga lu panga haṋi kha Common Voice.

source: We will be in touch with more information as it becomes available.
ve: Ri ḓo ni kwama nga ha uri hu khou itea mini musi ri tshi zwi tshi wanala.

source: We will not make your email public.
ve: A ri nga iti uri email yaṋu i vhonwe nga nnyi na nnyi.

source: We will review your request to remove your voice recordings from the dataset. If your request is approved, we will contact those who have downloaded the dataset and request they remove your voice recordings as well.
ve: Ri ḓo ṱolisisa khumbelo yaṋu ya u bvisa zwe na rekhoda kha dataset. Arali khumbelo yaṋu ya ṱanganedzwa, ri ḓo kwama vhe vha download yeneyo dataset nahone ra vha humbela uri vha bvise ipfi ḽaṋu na henefho.

source: What does it mean that I can’t “determine the identity” of speakers in the Common Voice dataset?
ve: Zwi amba mini uri a thi koni "u ḓivha" vhaambi vha re kha dataset ya Common Voice?

source: What is a language on Common Voice?
ve: Luambo ndi mini kha Common Voice?

source: What is Common Voice?
ve: Common Voice ndi mini?

source: What issues are you experiencing with this sentence?
ve: Ndi thaidzo dzifhio dzine na khou ṱangana nadzo kha hoyu mutaladzi?

source: What kind of goal do you want to build?
ve: Ndi tshipikwa ḓe tshine na khou ṱoḓa u tshi ita?

source: What level of audio quality is required for a voice clip to be used in the dataset?
ve: Hu ṱoḓea odio dzi re kha vhuimo ha hani uri dzi kone u shumisiwa kha dataset?

source: What’s inside the Common Voice dataset?
ve: Hu na mini nga ngomu ha dataset ya Common Voice?

source: What's Public?
ve: Ndi zwifhio zwa Tshitshavha?

source: What’s the difference between Common Voice and Deep Speech?
ve: Hu na phambano ifhio vhukati ha Common Voice na Deep Speech?

source: When a user rejects a voice clip it returns to the Queue. If rejected a second time, the voice clip is moved to the Clip Graveyard.
ve: Musi muthu a tshi ri ipfi ḽo rekhodiwaho a ḽo ngo tea, ḽi ḓo humela kha mutevhe. Arali ha pfi a ḽo ngo tea lwa vhuvhili, ipfi ḽeneḽo ḽi ya fhethu hune ha pfi Clip Graveyard.

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
ve: Musi no thetshelesa, ni sedze zwavhuḓi uri zwo rekhodiwaho zwi fana na zwo ṅwaliwaho kokotolo; ni hanele zwo rekhodiwa arali hu na vhukhakhi naho vhu vhuṱuku. <br />Vhukhakhi ho ḓoweleaho vhu katela:

source: When will you release Common Voice data in other languages?
ve: Ni ḓo riḽiza lini data ya Common Voice nga dziṅwe nyambo?

source: When you request your recordings, we compile them into one or multiple ZIP files. Here are your past requests:
ve: Musi ni tshi humbela zwe na rekhoda, ri zwi panga kha faela ya ZIP nthihi kana nnzhi. Khumbelo dzaṋu dza tshifhinga tsho fhiraho khedzi:

source: Where are these <wikipediaLink>public domain</wikipediaLink> sentences from?
ve: I bva ngafhi iyi mitaladzi ya<wikipediaLink>fhethu ha tshitshavha tshoṱhe?</wikipediaLink>

source: Where does the source text come from?
ve: Source text i bva ngafhi?

source: Which variant of { $language } do you speak?
ve: Ni amba varianti { $language } ifhio ya luambo?

source: Why ?
ve: Ngani ?

source: Why a profile?
ve: Ndi ngani profaiḽi?

source: Why Common Voice?
ve: Ndi ngani Common Voice

source: Why does this matter?
ve: Ndi ngani zwi zwa ndeme?

source: Why don’t you ask people to read from books or Wikipedia articles in different languages?
ve: Ndi ngani ni sa humbeli vhathu uri vha vhale dzibugu kana thero dzi re kha Wikipedia nga nyambo dzo fhambananaho?

source: Why do you need so many different speakers per language?
ve: Ndi ngani ni tshi ṱoḓa vhaambi vho fhambananaho vhanzhi kha luambo luthihi?

source: Why is 10,000 validated hours the per language goal for capturing audio?
ve: Ndi ngani awara dza 10,000 dzi dzone dzi no ṱoḓea sa tshipikwa kha luambo uri hu itwe odio?

source: Why is Common Voice part of the Mozilla mission?
ve: Ndi ngani Common Voice i tshipiḓa tsha zwine zwa khou itwa nga Mozilla?

source: Why is it important?
ve: Ndi ngani zwi zwa ndeme?

source: Why is my language not included yet?
ve: Ndi ngani luambo lwanga lu sa athu pangiwa?

source: Why should I sign up for an account?
ve: Ndi ngani ndi tshi tea u ita akhantu?

source: Would you like to request your voice recordings be deleted too, or do you prefer to keep them in the Common Voice dataset?
ve: Naa ni ṱoḓa na u ita khumbelo ya u phumula ipfi ḽaṋu ḽe na ḽi rekhoda, kana ni takalela uri zwi dzule zwi kha dataset ya Common Voice?

source: Xitsonga
ve: Turkish

source: Yes
ve: Ee

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
ve: Ee, vha nthumele email. Ndi nga takalela u dzula ndi tshi vhudziwa nga ha thandela dza Common Voice.

source: Yes, send me emails. I'd like to stay informed about the progress of this language on Common Voice.
ve: Ee, nthumeleni milaedza nga email. Ndi nga takalela u kwamiwa nga ha mvela phanḓa ya holwu luambo kha Common Voice.

source: Yes, we especially want your voice! Part of the aim of Common Voice is to gather as many different accents as possible so that voice recognition services work equally well for everyone. This means donations from non-native speakers are particularly important.
ve: Ee, ri khou ṱoḓa ipfi ḽaṋu! Tshiṅwe tsha zwipikwa zwa Common Voice ndi u kuvhanganya kuambele kunzhi kwo fhambananaho nga hune zwa ḓo konadzea ngaho u itela uri zwishumiswa zwa u ḓivha ipfi zwi shume zwavhuḓi kha vhathu vhoṱhe. Zwenezwi zwi amba uri na vhane vha si vhe vhaṋe vha luambo, u nikela havho ndi ha ndeme.

source: You
ve: Inwi

source: You are about to initiate a download of <size>{ $size }GB</size>, proceed?
ve: Ni khou thoma u downḽoda <size>{ $size }GB</size>, naa ni ṱoḓa u isa phanḓa?

source: You are prepared to initiate a download of <b>{ $size }</b>
ve: No lugela u thoma u downḽoda zwithu zwa <b>{ $size }</b>

source: You can also copy and paste the direct URLs into your favorite download manager. They will expire in 12 hours, but you can come back to this page to generate new ones any time.
ve: Ni nga kopa u ṋambatedza nga ho livhaho kha URLs u ya kha hune na ṱoḓa uri zwe na downḽouda zwi dzule hone. Zwi ḓo fhelelwa nga tshifhinga nga murahu ha awara dza 12, fhedzi ni nga dovha na vhuyelela kha ḽeneḽi siaṱari uri ni dovhe ni ite dziṅwe nga tshifhinga tshine na funa.

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
ve: Ni nga dovha hafhu na shumisa shortcuts dza Keyboard: { sc-review-form-button-approve-shortcut } u Khwaṱhisedza, { sc-review-form-button-reject-shortcut } u Hana, { sc-review-form-button-skip-shortcut } u Pfukha

source: You can choose to make your username public or anonymous.
ve: Ni nga nanga u ita uri username yaṋu i vhonwe nga nnyi na nnyi kana u i dzumba.

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
ve: Ni nga ya kha <datasetsPage>siaṱari ḽa dataset</datasetsPage>, ni khethe version na luambo (nyambo) lune na ṱoḓa, nahone ni lu danuḽode! Faela dzi na <metadataLink>metadata i tshimbidzanaho na</metadataLink>, zwithu zwi ngaho zwidodombedzwa zwa muthu na khwaṱhisedzo ya data. Ni ḓo tea uri ni ḓise email aḓiresi yaṋu u itela uri ni kone u downḽouda dataset.

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
ve: Ni nga thusa kha u ita dataset khulwane ya nnyi na nnyi nga u ita Profaiḽi ya Common Voice na u nikela nga ipfi ḽaṋu.

source: You can meet others in the Mozilla language communities by joining <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
ve: Ni nga ṱangana na vhaṅwe kha zwigwada zwa luambo zwa Mozilla nga u dzhena na vha tshipiḓa <discourseLink>Discourse</discourseLink> u wana nyambedzano, kana <matrixLink>Matrix</matrixLink> u wana tsivhudzo nga tshihaḓu.

source: You cannot request your recordings while another request is already in progress.
ve: Ni nga si kone u humbela zwe na rekhoda ngeno hu tshi kha ḓi vha na zwiṅwe zwe na zwi humbela zwi re nḓilani.

source: You can request a new takeout of your recordings every { $days } days.
ve: Ni nga humbela uri ni dzhie zwe na rekhoda { $days } ḓuvha ḽiṅwe na ḽiṅwe.

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
ve: Ni nga ita na mutambo wa u thusa vhathu uri vha shele mulenzhe. Zwenezwi zwo leluwa. Ni nga zwi ita muyani nga zwishumiswa zwa videoconferentsi, kana nga ho livhaho ni tshi khou vhonana na vhatu arali zwo tsireledzea. <eventTemplate>Ni vhone themphuḽeithi yashu na zwithu zwa uri hu vhe na mutambo</eventTemplate>.

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
ve: Ni nga <sentenceCollectorLinkAdd>dzhenisa mitaladzi i si gathi</sentenceCollectorLinkAdd>, kana ni nga <bulkImportDocsLink> imphotha minzhi-minzhi nga u shumisa Github</bulkImportDocsLink>. Ni humbule uri mitaladzi itea u vha <licenseLink>CC0 (kana public domain)</licenseLink>, kana ni nga ṅwana waṋu.

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
ve: Ni nga shumisa tshau <scraperLink>extraktha mitaladzi</scraperLink> u mannḓafhadza mitaladzi mipfufhi u bva kha Wikipedia.

source: You could include the website, e.g "Common Voice - https://commonvoice.mozilla.org/"
ve: Ni nga katela na website, e.g "Common Voice - https://commonvoice.mozilla.org/"

source: You could use academic referencing style, e.g Harvard style "Mozilla (2021) Common Voice. Available at https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"
ve: Ni nga shumisa tshi taela tsha academic ni tshi ita dzi referentsi, sa tsumbo Harvard style "Mozilla (2021) Common Voice. Zwi wanala kha https://commonvoice.mozilla.org/ (Accessed: 15th Khumbvumedzi 2021)"

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
ve: Ni nga shumisa social media platforms u itela u ḓivhadza vhaṅwe nga ha zwenezwi. Vha rumeleni milaedze i ṱalutshedzaho uri ndi ngani zwi zwa ndeme, nahone ni kwamane na vhaṅwe uri ni kone u amba navho nga ha pfanelo dza dzi nyambo, voice AI, kana tshiṱalula tshi re hone kha zwishumiswa zwa thekhinolodzhi. Vhonani nyeletshedzo dzo engedzeaho nga ha <campaignLink>u ita dzi campaign, na u vhona mafhungo ane na nga dovha na a shumisa </campaignLink>.

source: You have not added any languages yet.
ve: A ni athu u panga luambo na luthihi u swika zwino.

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
ve: A ni a thu u nanga na luambo na luthihi. Ri umbela uri ni ye kha <profileLink>Profaiḽi</profileLink> yaṋu uri ni nange nyambo.

source: You must allow microphone access.
ve: Ni tea u tendela uri makrofouni i shumiswe.

source: You previously skipped sentences while reviewing. Resetting skipped sentences will show all skipped sentences again. This is independent of the language.
ve: Murahuni no pfukha mitaladzi ni tshi khou vhalulula. U risetha mitaladzi yo pfukhiwaho zwi ḓo sumbedza mitaladzi yoṱhe ye na i pfukha. Hezwi zwi itea kha luambo luthihi nga tshetsho tshifhinga.

source: Your accent is the way you pronounce words. It can be shaped by where you have lived, which other languages you speak and lots of other factors. You can share any information you feel is relevant here.
ve: Kuambele ndi nḓila ine na bula ngayo maipfi. Zwenezwi zwi nga ḓitika nga hune na dzula hone, dziṅwe nyambo dzine na dzi amba na zwiṅwe zwithu zwinzhi. Ni nga ri vhudza zwenezwi zwithu zwine na pfa u nga zwi a tshimbidzana na zwenezwi hafha.

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
ve: Ipfi ḽaṋu ḽe na ḽi rekhoda zwi sa ḓivhei ḽi ḓo dzula ḽi kha dataset ya Common Voice. Arali na phumula profile yaṋu, a ni tsha ḓo kona u rumela khumbelo ya u bvisa zwe na rekhoda kha dataset

source: Your daily goal has been created
ve: Tshipikwa tshaṋu tsha ḓuvha tsho itiwa

source: Your download has started.
ve: No thoma u downḽoda

source: You’re contributing to a target segment
ve: Ni khou shela mulenzhe kha tshipiḓa tsha tshipikwa

source: You’re contributing to our first target segment
ve: Ni khou shela mulenzhe kha tshipiḓa tsha tshipikwa tshashu tsha u thoma

source: You're currently set to <bold>NOT</bold> receive emails such as goal reminders, my progress updates and newsletters about Common Voice
ve: Zwa zwino no pangiwa kha u <bold>U SA</bold> wana milaedza nga email yo no nga khumbudzo dza zwipikwa, mvela phanḓa yaṋu na newsletters nga ha Common Voice

source: You're currently set to receive emails such as goal reminders, my progress updates and newsletters about Common Voice
ve: Zwa zwino ni kha mutevhe wa vhane vha ḓo wana email dzi ngaho dza u ni humbudza nga ha zwipikwa, mvela phanḓa yaṋu na maswa maswa nga ha Common Voice

source: Your email address
ve: Email address yaṋu

source: Your files are being assembled. Please check again later.
ve: Faela dzaṋu dzi khou dzudzanyiwa. Sedzani hafhu hu si kale.

source: Your languages:
ve: Nyambo dzaṋu

source: Your Languages
ve: Nyambo dzaṋu

source: Your username and email will not be associated with the published data.
ve: Username yaṋu na email a zwi nga paṱekanyisiwi na data i no ḓo anḓadziwa.

source: Your weekly goal has been created
ve: Tshipikwa tshaṋu tsha vhege tsho itiwa

source: You should receive an email shortly explaining the steps to get your language added to Common Voice
ve: Ni tea u wana email hu si kale ine ya ḓo ni ṱalutshedza maga ane a tea u dzhiiwa uri hu pangiwe luambo lwaṋu kha Commn Voice

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
ve: No thusa Common Voice u swikelela <goalPercentage></goalPercentage> tsha ḓuvha { $goalValue } tshipikwa tsha u rekhoda!

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
ve: No thusa Common Voice u swikelela <goalPercentage></goalPercentage> tsha ḓuvha { $goalValue } tshipikwa tsha u khwaṱhisedza!

source: You've successfully signed up for contributing to { $language }. Thank you.
ve: No kona u ḓiṅwalisa uri ni kone u nikela { $language }. Ri a livhuwa.

source: Zip #{ $offset } of { $total }
ve: Zip #{ $offset } ya { $total }
